app/Controllers/Home.php

SELECT *
FROM `users`
WHERE `users`.`id` = 5
---
    public function acheter(): RedirectResponse|ResponseInterface
    {
        $userId   = session()->get('user_id');
        $regimeId = (int) $this->request->getPost('regime_id');
        $dureeId  = (int) $this->request->getPost('duree_id') ?: 3;

        if (!$userId || !$regimeId) {
            if ($this->request->isAJAX()) {
                return $this->response->setJSON([
                    'success' => false,
                    'message' => 'Session ou régime invalide.'
                ]);
            }

            return redirect()->to(base_url('/home'));
        }

        if ($this->userRegimeModel->aAchete($userId, $regimeId)) {
            if ($this->request->isAJAX()) {
                return $this->response->setJSON([
                    'success' => false,
                    'message' => 'Ce régime est déjà acheté.'
                ]);
            }

            return redirect()->to(base_url('/home'));
        }

        $user = $this->userModel->find($userId);