app/Controllers/Home.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `etat_user`
WHERE `user_id` = 4
 LIMIT 1
SELECT *
FROM `user_objectifs`
WHERE `user_id` = 4
 LIMIT 1
SELECT *
FROM `objectifs`
WHERE `objectifs`.`id` = '1'
SELECT *
FROM `regime_objectifs`
WHERE `objectif_id` = '1'
---
    public function index(): string|RedirectResponse
    {
        $userId = session()->get('user_id');

        if (!$userId) {
            return redirect()->to(base_url('/register'));
        }

        $user         = $this->userModel->find($userId);
        $isGold       = !empty($user['is_gold']);
        $etat         = $this->etatUserModel->where('user_id', $userId)->first();
        $userObjectif = $this->userObjectifModel->where('user_id', $userId)->first();
        $objectifNom  = null;

        if ($userObjectif) {
            $objectif = $this->objectifModel->find($userObjectif['objectif_id']);
            if ($objectif) {
                $objectifNom = $objectif['nom'];
            }
        }
        $regimes = [];
        $activites = [];

        if ($userObjectif) {
            $regimeObjectifs = $this->regimeObjectifModel
                ->where('objectif_id', $userObjectif['objectif_id'])
                ->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = 4
---
    public function acheter(): RedirectResponse
    {
        $userId   = session()->get('user_id');
        $regimeId = (int) $this->request->getPost('regime_id');
        $dureeId  = (int) $this->request->getPost('duree_id') ?: 3;

        if (!$userId || !$regimeId) {
            return redirect()->to(base_url('/home'));
        }

        if ($this->userRegimeModel->aAchete($userId, $regimeId)) {
            return redirect()->to(base_url('/home'));
        }

        $user = $this->userModel->find($userId);

UPDATE `portefeuilles` SET `solde` = 100250
WHERE `user_id` = 4
INSERT INTO `user_regimes` (`user_id`, `regime_id`, `duree_id`, `prix_paye`, `created_at`) VALUES (4, 3, 3, 29750, '2026-05-09 18:09:27')
---
        $db = \Config\Database::connect();
        $db->transStart();

        $db->table('portefeuilles')
           ->where('user_id', $userId)
           ->update(['solde' => $solde - $prix]);

        $this->userRegimeModel->insert([
            'user_id'   => $userId,
            'regime_id' => $regimeId,
            'duree_id'  => $dureeId,
            'prix_paye' => $prix,
        ]);