app/Controllers/Home.php

    public function index(): string
    {
        $userId = session()->get('user_id');

        if (!$userId) {
            return redirect()->to(base_url('/register'));
        }

        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 2
SELECT *
FROM `etat_user`
WHERE `user_id` = 2
 LIMIT 1