app/Controllers/PortefeuilleController.php

    public function index(): string|RedirectResponse
    {
        $userId = session()->get('user_id');

        if (!$userId) {
            return redirect()->to(base_url('/login'));
        }

        $user          = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 3