app/Controllers/RegimeCrud.php

SELECT *
FROM `regimes`
---
    public function api()
    {
        $model = new Regime();
        $search = $this->request->getGet('search');

        if ($search) {
            $regimes = $model->like('nom', $search)
                ->orLike('description', $search)
                ->findAll();
        } else {
            $regimes = $model->findAll();