app/Controllers/Register.php

    public function store2(): RedirectResponse
    {
        if (!session()->has('user_id')) {
            return redirect()->to(base_url('/register'));
        }

        $rules = [
            'taille' => 'required|numeric|greater_than[0.5]|less_than[3]',
            'poids' => 'required|numeric|greater_than[20]|less_than[500]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()
                ->withInput()
                ->with('errors', $this->validator->getErrors());
        }

        $data = [
            'user_id' => session()->get('user_id'),
            'taille' => $this->request->getPost('taille'),
            'poids' => $this->request->getPost('poids'),
        ];

        if (!$this->etatUserModel->insert($data)) {
            return redirect()->back()
                ->withInput()
                ->with('errors', ['general' => 'Erreur lors de la sauvegarde.']);
        }

        $etat = $this->etatUserModel
            ->where('user_id', session()->get('user_id'))
            ->first();
---
INSERT INTO `etat_user` (`user_id`, `taille`, `poids`, `created_at`, `updated_at`) VALUES (3, '1.50', '60', '2026-05-09 17:46:05', '2026-05-09 17:46:05')
SELECT *
FROM `etat_user`
WHERE `user_id` = 3
 LIMIT 1

    public function objectif()
    {
        if (!session()->has('user_id')) {
            return redirect()->to(base_url('/register'));
        }

        $objectifs = $this->objectifModel->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `objectifs`
ORDER BY `id` ASC

    public function storeObjectif(): RedirectResponse
    {
        if (!session()->has('user_id')) {
            return redirect()->to(base_url('/register'));
        }

        $rules = [
            'objectif_id' => 'required|is_not_unique[objectifs.id]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()
                ->withInput()
                ->with('errors', $this->validator->getErrors());
        }

        $userId = session()->get('user_id');
        $objectifId = $this->request->getPost('objectif_id');

        $existing = $this->userObjectifModel->where('user_id', $userId)->first();

        if ($existing) {
            $this->userObjectifModel->update($existing['id'], [
                'user_id' => $userId,
                'objectif_id' => $objectifId,
            ]);
---
SELECT *
FROM `user_objectifs`
WHERE `user_id` = 1
 LIMIT 1
SELECT *
FROM `etat_user`
WHERE `user_id` = 2
 LIMIT 1
UPDATE `user_objectifs` SET `user_id` = 1, `objectif_id` = '2'
WHERE `user_objectifs`.`id` IN ('1')