app/Controllers/Register.php

SELECT *
FROM `objectifs`
ORDER BY `id` ASC
---
    public function objectif()
    {
        if (!session()->has('user_id')) {
            return redirect()->to(base_url('/register'));
        }

        $objectifs = $this->objectifModel->orderBy('id', 'ASC')->findAll();