app/Models/ActiviteSportive.php

SELECT `activites_sportives`.*
FROM `activites_sportives`
JOIN `regime_activites` ON `regime_activites`.`activite_id` = `activites_sportives`.`id`
WHERE `regime_activites`.`regime_id` = 1
---
    public function getByRegime(int $regimeId): array
    {
        $db = \Config\Database::connect();

        return $db->table('activites_sportives')
                  ->select('activites_sportives.*')
                  ->join('regime_activites', 'regime_activites.activite_id = activites_sportives.id')
                  ->where('regime_activites.regime_id', $regimeId)
                  ->get()
                  ->getResultArray();