app/Models/Admin.php

    public function verifyPassword(string $password): bool
    {

        $admin = $this->first();
---
SELECT *
FROM `admins`
 LIMIT 1