app/Models/Portefeuille.php

    public function getSolde(int $userId): float
    {
        $row = $this->where('user_id', $userId)->first();
---
SELECT *
FROM `portefeuilles`
WHERE `user_id` = 4
 LIMIT 1

    public function getHistorique(int $userId, int $limit = 10): array
    {
        $db = \Config\Database::connect();

        return $db->table('recharge_portefeuille rp')
                  ->select('rp.montant, rp.created_at, cr.code')
                  ->join('codes_recharge cr', 'cr.id = rp.code_id')
                  ->where('rp.user_id', $userId)
                  ->orderBy('rp.created_at', 'DESC')
                  ->limit($limit)
                  ->get()
                  ->getResultArray();
---
SELECT `rp`.`montant`, `rp`.`created_at`, `cr`.`code`
FROM `recharge_portefeuille` `rp`
JOIN `codes_recharge` `cr` ON `cr`.`id` = `rp`.`code_id`
WHERE `rp`.`user_id` = 3
ORDER BY `rp`.`created_at` DESC
 LIMIT 10