app/Models/Regime.php

    public function getAvecPrix(int $regimeId, int $dureeId = 3): ?array
    {
        $regime = $this->find($regimeId);

        if (!$regime) {
            return null;
        }

        $db  = \Config\Database::connect();
        $row = $db->table('regime_prix')
                  ->where('regime_id', $regimeId)
                  ->where('duree_id', $dureeId)
                  ->get()
                  ->getRowArray();
---
SELECT *
FROM `regimes`
WHERE `regimes`.`id` = 1
SELECT *
FROM `regime_prix`
WHERE `regime_id` = 1
AND `duree_id` = 3