app/Models/User.php

INSERT INTO `users` (`nom`, `email`, `genre_id`, `password`, `created_at`, `updated_at`) VALUES ('hubert', 'hubert@gmail.com', '3', '$2y$10$MwAYcxUgGX/tYA6pYoHVdOBzaMwRCFtvUb9bqgjuYbcPnl6D8PY3K', '2026-05-08 05:24:49', '2026-05-08 05:24:49')
---
    public function createUser(array $data)
    {
        $data['password'] = password_hash($data['password'], PASSWORD_DEFAULT);

        if ($this->insert($data)) {

SELECT *
FROM `users`
WHERE `email` = 'maudeck87@gmail.com'
 LIMIT 1
---
    public function getByEmail(string $email): ?array
    {
        $user = $this->where('email', $email)->first();