app/Models/UserRegime.php

    public function aAchete(int $userId, int $regimeId): bool
    {
        return $this->where('user_id', $userId)
                    ->where('regime_id', $regimeId)
                    ->first() !== null;
---
SELECT *
FROM `user_regimes`
WHERE `user_id` = 4
AND `regime_id` = 1
 LIMIT 1

    public function getRegimesAchetes(int $userId): array
    {
        $db = \Config\Database::connect();

        return $db->table('user_regimes ur')
                  ->select('
                      ur.id           AS achat_id,
                      ur.prix_paye,
                      ur.created_at   AS date_achat,
                      r.id            AS regime_id,
                      r.nom           AS regime_nom,
                      r.description   AS regime_description,
                      r.variation_poids,
                      r.pourcentage_viande,
                      r.pourcentage_poisson,
                      r.pourcentage_volaille,
                      d.nom           AS duree_nom,
                      d.nombre_jours
                  ')
                  ->join('regimes r', 'r.id = ur.regime_id')
                  ->join('durees d',  'd.id = ur.duree_id')
                  ->where('ur.user_id', $userId)
                  ->orderBy('ur.created_at', 'DESC')
                  ->get()
                  ->getResultArray();
---
SELECT `ur`.`id` AS `achat_id`, `ur`.`prix_paye`, `ur`.`created_at` AS `date_achat`, `r`.`id` AS `regime_id`, `r`.`nom` AS `regime_nom`, `r`.`description` AS `regime_description`, `r`.`variation_poids`, `r`.`pourcentage_viande`, `r`.`pourcentage_poisson`, `r`.`pourcentage_volaille`, `d`.`nom` AS `duree_nom`, `d`.`nombre_jours`
FROM `user_regimes` `ur`
JOIN `regimes` `r` ON `r`.`id` = `ur`.`regime_id`
JOIN `durees` `d` ON `d`.`id` = `ur`.`duree_id`
WHERE `ur`.`user_id` = 3
ORDER BY `ur`.`created_at` DESC